[
    {"title":"Second at UMD HSPC",
    "date":"Feb 26, 2023",
    "content":"Joshua Hsieh, Valerie Song, Joshua Wang, and Kelin Zhu placed second at UMD's High School Programming Competition and were the highest placing team from Maryland."},
    {"title":"Gold at EGOI",
    "date":"June 21, 2021",
    "content":"Claire Zhang won a gold medal at the European Girls Olympiad in Informatics with a 13th place finish. She was the top US competitor."},
    {"title":"Fifth Place in AGM Final Round",
    "date":"June 13, 2021",
    "content":"Timothy Qian, Colin Galen, and Gabriel Wu won fifth place in the Adolescent Grigore Moisil International Programming Contest Final Round."},
    {"title":"mBIT 2021 Spring Online Round",
    "date":"June 12, 2021",
    "content":"Comp Team hosted the fourth iteration of the Montgomery Blair Informatics Tournament online this weekend. The event attracted over 500 competitors from across the world. Koresha won first place in the Advanced division, and Remdi™ won in the Standard division."},
    {"title":"1st Place at Stanford Programming Competition",
    "date":"May 15, 2021",
    "content":"Timothy Qian, Colin Galen, and Gabriel Wu won first place at the Stanford Programming Competition (ProCo), solving 13 out of 14 problems in 92 minutes."},
    {"title":"Blair on US EGOI Team",
    "date":"May 4, 2021",
    "content":"Claire Zhang was selected to be one of the four members of the US team competing at the European Girls Olympiad in Informatics (EGOI)."},
    {"title":"1st Place at TeamsCode",
    "date":"April 27, 2021",
    "content":"Timothy Qian, Colin Galen, Gabriel Wu, and Maxwell Zhang won first place at the TeamsCode Spring 2021 Online Coding Contest, Advanced Division."},
    {"title":"Three Blair USACO Finalists",
    "date":"April 25, 2021",
    "content":"Timothy Qian, Colin Galen, and Gabriel Wu were selected to participate in the prestigious USACO camp, intended to train the US team for the International Olympiad in Informatics."},
    {"title":"1st Place in AGM Qualification Round",
    "date":"February 20, 2021",
    "content":"Timothy Qian, Colin Galen, and Gabriel Wu won first place in the Adolescent Grigore Moisil International Programming Contest Qualifying Round, advancing to the Final Round in Romania this summer."},
    {"title":"2nd and 3rd Place at TeamsCode",
    "date":"November 23, 2020",
    "content":"Timothy Qian, Colin Galen, Gabriel Wu, and Maxwell Zhang won second place at the TeamsCode Fall 2020 Online Coding Contest. Jeffrey Tong, Claire Zhang, Phillip Guo, and Jason An won third place."},
    {"title":"mBIT 2020 Fall Online Round",
    "date":"November 14, 2020",
    "content":"Comp Team hosted the third iteration of the Montgomery Blair Informatics Tournament online this weekend. The event attracted almost 500 competitors from across the world, including competitors from Croatia, Ukraine, Russia, India, and Singapore. Zagreb Oblutci won first place in the Advanced division, and &#60;input class=\"input\" placeholder=\"Insert Creative Name Here\"&#62; won in the Standard division."},
    {"title":"3rd Place at Lexington Informatics Tournament",
    "date":"August 24, 2020",
    "content":"Timothy Qian, Colin Galen, and Gabriel Wu won third place at the Lexington HS Informatics Tournament, solving all 6 problems in 160 minutes. Ayush Varshney, Maxwell Zhang, and Aaron Mei won sixth place."},
    {"title":"1st Place in Noctem Virtual",
    "date":"July 26, 2020",
    "content":"Colin Galen, Gabriel Wu, Timothy Qian, Ayush Varshney, and Maxwell Zhang won first place in the Noctem Virtual online programming competition, solving all 7 problems in 17 minutes."},
    {"title":"mBIT 2020 Spring Online Round",
    "date":"June 7, 2020",
    "content":"Comp Team hosted the second iteration of the Montgomery Blair Informatics Tournament, online this time. The event attracted almost 300 competitors from across the world. <i>Sponsored by Raid: Shadow Legends</i> won first place in the Advanced division, and <i>orzosities</i> won first place in the Standard division."},
    {"title":"Timothy Qian qualified for USACO Camp",
    "date":"May 23, 2020",
    "content":"Timothy was selected to participate in the prestigious USACO camp, intended to train the US team for the International Olympiad in Informatics."},
    {"title":"1st Place at UMD HSPC",
    "date":"February 29, 2020",
    "content":"Timothy Qian, Colin Galen, Ayush Varshney, and Gabriel Wu won first place at the University of Maryland High School Programming Contest, solving all 8 problems in 97 minutes."},
    {"title":"3rd Place at MIT Battlecode",
    "date":"January 30, 2020",
    "content":"Kevin Higgs, Gabriel Wu, Timothy Qian, and Colin Galen won 3rd place in the MIT Battlecode bot programming competition (high school division)."},
    {"title":"1st Place at PClassic 2019 Fall",
    "date":"November 23, 2019",
    "content":"Gabriel Wu, Timothy Qian, Colin Galen, and Kevin Higgs won first place at PClassic, once again solving 7 out of 8 problems."},
    {"title":"First Montgomery Blair Informatics Tournament",
    "date":"November 2, 2019",
    "content":"The MBHS Computer Team hosted the first ever Montgomery Blair Informatics Tournament, which attracted 120 middle and high school competitors. <i>Blairleraos</i> from TJHSST won first place in the Varsity division, and <i>One Hundo Percent Not FBI</i> from Blair and Takoma Park MS won first place in the Rookie division."},
    {"title":"1st Place at PClassic 2019 Spring",
    "date":"March 30, 2019",
    "content":"Gabriel Wu, Timothy Qian, Kevin Higgs, and Maxwell Zhang won first place at PClassic, solving 7 out of 8 problems."}
]
